/* 校验正则集 */

const RegRules = {
    // 手机号校验
    phoneNumber: /^1\d{10}$/,

    // 邮箱校验
    email: /^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/,

    // 实例名称校验 支持中文、字母、数字以及_
    shiliName: /^[a-zA-Z\u4E00-\u9FA5][0-9a-zA-Z\u4e00-\u9fa5-]{1,63}$/,

    // 镜像名称校验 支持中文、字母、数字以及-
    imageName: /^[\u4E00-\u9FA5a-zA-Z0-9-]{1,64}$/,

    // 密码校验 密码校验 大写、小写、数字、特殊字符.!@#￥%^()_+-=占三种，长度为8-32位
    pw: /^(?![A-Za-z]+$)(?![A-Z0-9]+$)(?![A-Z.!@#￥%^()_+\-=]+$)(?![a-z0-9]+$)(?![a-z.!@#￥%^()_+\-=]+$)(?![0-9.!@#￥%^()_+\-=]+$)[a-zA-Z0-9.!@#￥%^()_+\-=]{8,32}$/,//eslint-disable-line

    // 账号名称校验 支持小写字母，数字，下划线组成，字母开头，最长16个字符
    accountName: /^[a-z][a-z0-9_]{0,15}$/,

    // 支持字母，数字以及_，字母开头，长度限制为1-32个字符
    dbName: /^[a-zA-Z][A-Za-z0-9_]{0,31}$/,

    // 描述信息长度在2-256之间
    des: /^[\s\S]{2,256}$/,

    // 命名空间名称
    namespace: /^[a-z0-9][a-z0-9_-]{0,28}[a-z0-9]$/,

    // 仓库名称
    wareHouseName: /^[a-z0-9][a-z0-9_.-]{0,38}[a-z0-9]$/,

    // 部署应用名称
    applicationName: /^[A-Za-z0-9][A-Za-z0-9-]{0,63}$/,
};

export default RegRules;
