/* 校验正则集 */

const RegRules = {
    // 手机号校验
    phoneNumber: /^1\d{10}$/,

    // 邮箱校验
    email: /^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/,

    // 实例名称校验 支持中文、字母、数字以及_
    shiliName: /^[\u4E00-\u9FA5a-zA-Z0-9_]{1,64}$/,

    // 密码校验 字母和数字组成，长度为8-32位
    pw: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,32}$/,

    // 账号名称校验 支持小写字母，数字，下划线组成，字母开头，最长16个字符
    accountName: /^[a-z][a-z0-9_]{0,15}$/,

    // 支持字母，数字以及_，字母开头，长度限制为1-32个字符
    dbName: /^[a-zA-Z][A-Za-z0-9_]{0,31}$/,

    // 描述信息长度在0-100之间
    des: /^[\s\S]{0,100}$/,

    // 命名空间名称
    namespace: /^[a-z0-9][a-z0-9_-]{0,28}[a-z0-9]$/,

    // 仓库名称
    wareHouseName: /^[a-z0-9][a-z0-9_.-]{0,38}[a-z0-9]$/,

    // 部署应用名称
    applicationName: /^[A-Za-z0-9][A-Za-z0-9-]{0,63}$/,
};

export default RegRules;
